#!/bin/bash
#程序功能：测试一个没有参量的read会怎么样。
#结果，输入将分配给默认变量$REPLY

echo

# -------------------------- #
echo -n "Enter a value: "
read var
echo "\"var\" = "$var""
# 到这里为止, 都与期望的一样.
# -------------------------- #

echo

# ------------------------------------------------------------------- #
echo -n "Enter another value(read now has no param): "
read           #  没有变量分配给'read'命令, 所以...
               #+ 输入将分配给默认变量, $REPLY.
var="$REPLY"
echo "\"REPLY\" = "$var""
# 这部分代码和上边的代码等价.
# ------------------------------------------------------------------- #

echo

exit 0
